In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

### 예제 1 
아래 시리즈에서 null이 아닌 부분을 출력해보고
NaN의 값을 0으로 바꾼후 내용을 출력하시오.

In [2]:
sdata = {'Ohio': 35000,
         'Texas': 71000,
         'Oregon': 16000,
         'Utah': 5000}

states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### 예제 2
아래 데이터 프레임을 사용하여 index가 four인 행의 값을 [1999, 'Ohio', 3.2, 0]으로 변경하시오.

In [3]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2002, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

frame = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])

frame

       year   state  pop debt
one    2002    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

### 예제 3
frame에서 index가 two, column이 state 인 위치의 값을 'Nevada'로 변경하시오.

### 예제 4 
frame에 year=2002이고 state='Ohio' 일때 True를 갖는 etc 컬럼을 생성하시오.

### 예제 5 
frame에서 one, three, four 행에서 year, state, etc 열만 가져와 frame2에 저장하시오. <br>
또한, frame2에서 year > 2000, state == Ohio 인 행을 출력 하시오.

### 예제 6 
임의의 데이터 프레임을 생성하고 각 행과 열의 합을 각각 계산하여 출력하시오.

### 예제 7
아래 int_frame을 index, column기준으로 정렬하시오. (단, index, column 모두 정렬되어야 함)<br>

In [4]:
int_frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'b', 'c', 'a'])
int_frame

       d  b  c  a
three  0  1  2  3
one    4  5  6  7

### 예제 8
코스피와 IBM 가격정보를 불러와 상관관계를 파악하시오.<br>
코스피 = ^KS11

### 예제 9
아래 주어진 df 에서 <br>
2~3행에서 '0'컬럼을 None으로 <br>
0~2행에서 '2'컬럼을 None으로 변경하시오.<br>
마지막으로 각 컬럼의 None값들을 각 컬럼의 평균값으로 채우시오.
column = 0, 1, 2

In [5]:
df = DataFrame(np.arange(21).reshape(7, 3))
df

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14
5  15  16  17
6  18  19  20

### 예제 10
multi_idx 이름으로 0 ~ 20의 값을 갖는 (5,4) 데이터 프레임을 생성하시오 <br>
데이터프레임 생성 후 index=b, column= korea의 naju에 해당하는 값을 출력하시오.<br>
--> 상위 색인은 a, a, b, b, c로 구성되며 하위 색인은 1,2, 1, 2, 1로 구성하시오. <br>
--> columns은 'busan', 'naju', 'chuncheon', 'seoul'와 'korea', 'korea', 'usa', 'usa'로 구성된다. <br>

### 예제 11
위 multi_idx 데이터프레임에 index와 column 이름을 설정하고 2번째 index로 데이터 프레임을 정렬 하시오.<br>
추가로, column의 위치를 서로 바꿔보시오.

<br><br><br><br><br><br><br><br><br><br><br>

### 정답
아래 각 셀이 각 문제의 정답

In [6]:
# 1번
print("Null이 아닌 값 : \n", obj4[pd.notnull(obj4)],"\n")

obj4[pd.isnull(obj4)] = 0
print("Null을 0으로 바꾼 후 : \n", obj4)

Null이 아닌 값 :
 Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

Null을 0으로 바꾼 후 :
 California        0.0
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [7]:
# 2번
frame.ix['four'] = [1999, 'Ohio', 3.2, 0]
frame

       year   state  pop debt
one    2002    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   1999    Ohio  3.2    0
five   2002  Nevada  2.9  NaN

In [8]:
# 3번
frame.loc['two', 'state'] = 'Nevada'
frame

       year   state  pop debt
one    2002    Ohio  1.5  NaN
two    2001  Nevada  1.7  NaN
three  2002    Ohio  3.6  NaN
four   1999    Ohio  3.2    0
five   2002  Nevada  2.9  NaN

In [9]:
# 4번
frame['etc'] = ((frame.state == 'Ohio') & (frame.year == 2002))
frame

       year   state  pop debt    etc
one    2002    Ohio  1.5  NaN   True
two    2001  Nevada  1.7  NaN  False
three  2002    Ohio  3.6  NaN   True
four   1999    Ohio  3.2    0  False
five   2002  Nevada  2.9  NaN  False

In [10]:
# 5번
frame2 = frame.ix[['one', 'five', 'four'], ['year','state','etc']]
frame2.ix[((frame2.year > 2000)& (frame2.state=='Ohio')), :2]

     year state
one  2002  Ohio

In [11]:
# 6번

frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])


print(frame,"\n")

# lambda 식 또는 함수를 정의하여 활용 (둘중 하나의 방식 선택)
f = lambda x: x.sum()

def f1(x):
    mul = 0
    for i in x:
        mul=mul+i

    return mul

    
#열의 합
print("열 합\n",frame.apply(f),"\n")

#행의 합
print("행 합\n",frame.apply(f1, axis=1))

               b         d         e
Utah   -0.301872 -0.173117  0.024701
Ohio    0.083876 -0.317091  2.129143
Texas  -1.131228  1.012380  1.294039
Oregon -0.209238 -0.678700 -1.653261

열 합
 b   -1.558462
d   -0.156528
e    1.794622
dtype: float64

행 합
 Utah     -0.450288
Ohio      1.895928
Texas     1.175191
Oregon   -2.541199
dtype: float64

In [12]:
# 7번
int_frame.sort_index().sort_index(axis=1)

       a  b  c  d
one    7  5  6  4
three  3  1  2  0

In [21]:
# 8번 
from pandas_datareader import data as web
all_data = {}
for ticker in ['^KS11', 'IBM']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.items()})

price.corr()

ModuleNotFoundError: No module named 'pandas_datareader'

In [14]:
# 9번
df.ix[2:3, 0] = None; 
df.ix[:2, 2] = None
df.fillna({0:df[0].mean(), 1:df[1].mean(), 2:df[2].mean()})

      0   1     2
0   0.0   1  15.5
1   3.0   4  15.5
2   9.6   7  15.5
3   9.6  10  11.0
4  12.0  13  14.0
5  15.0  16  17.0
6  18.0  19  20.0

In [15]:
# 10번
multi_idx = DataFrame(np.arange(20).reshape((5, 4)),  
                  index=[['a', 'a', 'b', 'b', 'c'], [1, 2, 1, 2, 1],], 
                  columns=[['usa', 'korea',  'korea', 'usa'],  
                           ['la', 'naju', 'chuncheon', 'newyork'], ])

multi_idx

    usa korea               usa
     la  naju chuncheon newyork
a 1   0     1         2       3
  2   4     5         6       7
b 1   8     9        10      11
  2  12    13        14      15
c 1  16    17        18      19

In [16]:
multi_idx.ix['b', ('korea', 'naju')]

1     9
2    13
Name: (korea, naju), dtype: int64

In [17]:
# 11번
multi_idx.columns.names = ["country", "region"]
multi_idx.index.names = ["key1", "key2"]
multi_idx

country   usa korea               usa
region     la  naju chuncheon newyork
key1 key2
a    1      0     1         2       3
     2      4     5         6       7
b    1      8     9        10      11
     2     12    13        14      15
c    1     16    17        18      19

In [18]:
# key2 인덱스를 기준으로 정렬
multi_idx.sortlevel('key2')

country   usa korea               usa
region     la  naju chuncheon newyork
key1 key2
a    1      0     1         2       3
b    1      8     9        10      11
c    1     16    17        18      19
a    2      4     5         6       7
b    2     12    13        14      15

In [19]:
# 컬럼 이름 순서 변경 ( 맨뒤 1은 axis=1을 의미 )
multi_idx.swaplevel("region", "country", 1)

region     la  naju chuncheon newyork
country   usa korea     korea     usa
key1 key2
a    1      0     1         2       3
     2      4     5         6       7
b    1      8     9        10      11
     2     12    13        14      15
c    1     16    17        18      19